//начало текста модуля

///////////////////////////////////////////////////
//Служебные функции и процедуры
///////////////////////////////////////////////////

&НаКлиенте
// контекст фреймворка Vanessa-Behavior
Перем Ванесса;
 
&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Behavior.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЕстьДатаРожденияЧеловекаРавная(Парам01)","ЕстьДатаРожденияЧеловекаРавная","Допустим есть дата рождения человека равная 22.10.1976");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ТекущаяДатаРавная(Парам01)","ТекущаяДатаРавная","и текущая дата равная 22.08.2016");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"РезультатВычисленияБудетРавен(Парам01)","РезультатВычисленияБудетРавен","Тогда результат вычисления будет равен 478");

	Возврат ВсеТесты;
КонецФункции
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции



///////////////////////////////////////////////////
//Работа со сценариями
///////////////////////////////////////////////////

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры



///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
//Допустим есть дата рождения человека равная 22.10.1976
//@ЕстьДатаРожденияЧеловекаРавная(Парам01)
Процедура ЕстьДатаРожденияЧеловекаРавная(ДатаРождения) Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	Контекст.Вставить("ДатаРождения", ДатаРождения);
КонецПроцедуры

&НаКлиенте
//и текущая дата равная 22.08.2016
//@ТекущаяДатаРавная(Парам01)
Процедура ТекущаяДатаРавная(мТекущаяДата) Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	Контекст.Вставить("ТекущаяДата", мТекущаяДата);
КонецПроцедуры

&НаКлиенте
//Тогда результат вычисления будет равен 478
//@РезультатВычисленияБудетРавен(Парам01)
Процедура РезультатВычисленияБудетРавен(ОжидаемыйРезультат) Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	Результат = ОбщийМодуль1.ПолучитьВозрастВМесяцах(Контекст.ДатаРождения, Контекст.ТекущаяДата);
	Если Результат<>ОжидаемыйРезультат Тогда
	    ВызватьИсключение "Результат рассчитан неверно";
	КонецЕсли; 
КонецПроцедуры

//окончание текста модуля